// Вызов серверной функции для открытия журнала регистрации по объекту
Процедура КомандаОткрытьЖурналРегистрации(Форма) Экспорт
    
    ЛогИ_ОбщийМодуль.КомандаОткрытьЖурналРегистрации(Форма);
    
КонецПроцедуры

// Получение данных для отбора в журнале регистрации
Функция ПолучитьДанныеДляОтбора(ТекущийОбъект) Экспорт
    
    Если ТекущийОбъект = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    // Создаем структуру с параметрами отбора
    ПараметрыОтбора = Новый Структура;
    ПараметрыОтбора.Вставить("Событие", "Лог. Изменение данных");
    ПараметрыОтбора.Вставить("Данные", ТекущийОбъект);
    
    Возврат ПараметрыОтбора;
    
КонецФункции