&После("ПриОпределенииВидовПодключаемыхКоманд")
Процедура ЛогИ_ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд)

    Вид = ВидыПодключаемыхКоманд.Добавить();
    Вид.Имя         = "ЛогИ_ЖурналРегистрации";
    Вид.ИмяПодменю  = "ЛогИ_ЖурналРегистрации";
    Вид.Заголовок   = НСтр("ru = 'Логгирование'");
    Вид.Порядок     = 80;

КонецПроцедуры

&После("ПриОпределенииКомандПодключенныхКОбъекту")
Процедура ЛогИ_ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды)

    Команда = Команды.Добавить();
    Команда.Вид              = "ЛогИ_ЖурналРегистрации";
    Команда.Идентификатор    = "ЛогИ_ИсторияИзмененийВЖР";
    Команда.Представление    = НСтр("ru = 'История изменений (журнал регистрации)'");
    Команда.Назначение       = "ДляОбъекта";
    Команда.МножественныйВыбор       = Ложь;
    Команда.ИзменяетВыбранныеОбъекты = Ложь;
    Команда.Обработчик       = "ЛогИ_ОбщийМодульКлиент.ОткрытьЖурналРегистрацииПоОбъекту";

КонецПроцедуры
