Процедура ОткрытьЖурналРегистрацииПоОбъекту(СсылкаНаОбъект, Контекст) Экспорт
    Если
        Не ЗначениеЗаполнено(СсылкаНаОбъект)
    Тогда
        Возврат;
    КонецЕсли;
    Отбор           =   Новый Структура;
    Отбор.Вставить("ДатаНачала", '00010101');
    МассивСобытий   =   Новый Массив;
    МассивСобытий.Добавить("Лог. Изменение Данных");
    Отбор.Вставить("Событие", МассивСобытий);
    Отбор.Вставить("Данные", СсылкаНаОбъект);
    ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(Отбор);
КонецПроцедуры
